<script setup lang="ts">

</script>

<template>
  <section class="info">
    <div class="container">
      <div class="info__content">
        <div class="info__block">
          <div class="info__title">Оплата</div>
          <div class="info__desc">Оплата происходит через авторизационный сервер Процессингового центра Банка с
            использованием Банковских кредитных карт платежной системы МИР. <br><br> Для осуществления платежа Вам потребуется
            ввести данные Вашей пластиковой карты. Передача этих сведений производится с соблюдением всех необходимых
            мер безопасности. Данные будут сообщены только на авторизационный сервер Банка по защищенному каналу
            (протокол SSL 3.0). Информация передается в зашифрованном виде и сохраняется только на специализированном
            сервере платежной системы. Интернет-магазин не знает и не хранит данные по вашей пластиковой карте. <br><br> При
            выборе формы оплаты с помощью пластиковой карты проведение платежа по заказу производится непосредственно
            после его оформления. После завершения оформления заказа в нашем магазине, Вы будете автоматически
            перенаправлены на страницу оплаты. Если этого не произошло, вам следует нажать на кнопку "Оплата картой",
            при этом система переключит Вас на страницу авторизационного сервера, где Вам будет предложено ввести данные
            пластиковой карты, инициировать ее авторизацию, после чего вернуться в наш магазин кнопкой "Вернуться в
            магазин". После того, как Вы возвращаетесь в наш магазин, система уведомит Вас о результатах авторизации. В
            случае подтверждения авторизации Ваш заказ будет автоматически выполняться в соответствии с заданными Вами
            условиями. В случае отказа в авторизации карты Вы сможете повторить процедуру оплаты.
          </div>
        </div>
        <div class="info__block">
          <div class="info__title">Доставка</div>
          <div class="info__desc">Мы доставляем заказы по всей территории Российской Федерации, сотрудничаем с
            курьерскими компаниями СДЭК, Boxberry и другими логистическими решениями. <br><br> Cтоимость и cроки доставки
            определяются компанией-партнёром (службой доставки) и просчитываются в момент оформления заказа. Данный
            процесс полностью автоматизирован, мы не влияем на тарифы и сроки курьерской компании. <br><br> Передача заказов в
            курьерские службы осуществляются на следующей день, после 100% оплаты, при условии наличия заказанных
            товаров на складе.
          </div>
        </div>
        <div class="info__block">
          <div class="info__title">Возврат</div>
          <div class="info__desc">Согласно Постановлению Правительства РФ № 2463 от 31.12.2020, парфюмерно-косметические
            товары надлежащего качества не подлежат обмену или возврату в течение 14 дней <br><br> В случае обнаружения
            некачественного товара, просим написать по адресу электронной почты greentrio@yandex.ru для обмена/возврата
            товара
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<style lang="scss" scoped>
.info {
  background: url("/assets/images/backgrounds/loader.png") 50% 50% no-repeat;
  background-size: cover;

  min-height: 100vh;

  .container {
    padding-top: 160px;
  }

  &__content {
    display: grid;
    grid-template-columns: 1fr 1fr;
    grid-template-rows: 1fr 1fr;
    gap: 80px;

    font-weight: 300;
  }

  &__title {
    font-size: 24px;
    padding-bottom: 24px;
  }

  &__desc {
    line-height: 1.5em;
  }

  &__block:nth-child(1) {
    grid-row: 1/-1;
  }
}
</style>